from tabulate import tabulate

# ====================================================
table1 = [
    ["Алфавіт джерела", "Значення кодових слів", "Вірогідність", "Код Хаффмана", "Число символів"],
    ["a", "x0", "0.7", "1", "1"],
    ["b", "x1", "0.3", "0", "1"]
]

print("Таблиця 1")
print(tabulate(table1))
# ====================================================



# ====================================================
table2 = [
    ["Алфавіт джерела", "Значення кодових слів", "Вірогідність", "Код Хаффмана", "Число символів"],
    ["aa","y0",0.49,0,1],
    ['ab','y1',0.21,111],
    ['ba','y2',0.21,10,2],
    ['bb','y3',0.09,110,3]
]

print("Таблиця 2")
print(tabulate(table2))
# ====================================================


# ====================================================
table3 = [
    ["Алфавіт джерела", "Значення кодових слів", "Вірогідність", "Код Хаффмана", "Число символів"],
    ['aaa','z0',0.343,'011',3],
    ['aab','z1',0.147,'0100',4],
    ['aba','z2',0.147,'0101',4],
    ['abb','z3',0.063,'00101',5],
    ['baa','z4',0.147,'000',3],
    ['bab','z5',0.063,'00110',5],
    ['bba','z6',0.063, '00111', 5],
    ['bbb', 'z7',0.027,'00100',5]
]

print("Таблиця 3")
print(tabulate(table3))
# ====================================================


# ====================================================

table4 = [
    ["Алфавіт джерела", "Значення кодових слів", "Вірогідність", "Код Хаффмана", "Число символів"],

    ['aaaa','q0',0.2401,'10',2],
    ['aaab','q1',0.1029,'001',3],
    ['aaba','q2',0.1029,'000',3],
    ['aabb','q3',0.0441,'11011',5],
    ['abaa','q4',0.1029,'010',3],
    ['abab','q5',0.0441,'11100',5],
    ['abba','q6',0.0441, '11101', 5],
    ['abbb', 'q7',0.0189,'110001',6],

    ['baaa','q8',0.0189,'110010',6],
    ['baab','q9',0.1029,'011',3],
    ['baba','q10',0.0441,'11110',5],
    ['babb','q11',0.0189,'110011',6],
    ['bbaa','q12',0.0441,'11111',5],
    ['bbab','q13',0.0189,'110100',6],
    ['bbba','q14',0.0189, '110101', 7],
    ['bbbb', 'q15',0.0081,'110000',8]
]

print("Таблиця 4")
print(tabulate(table4))
# ====================================================


print("Таблиця 5: РОЗРАХУНОК ПОКАЗНИКІВ")
table5 = [
    ['Номер таблиці', "Середня довжина слова", "Середня довнажина на символ", "Ентропія джерела", "Удільна ентропія", "Чрезмірність джерела", "Чрезміність коду", "Мінімальна довжина кодового слова", "Відношення мінільної довжини до середеньої"],
    [1,	1,	1,	0.8813,	0.8813,	0.1187,	0.8813,	1,	1],
    [2,	3,	1,	1.763,	1.763,	0.1187,	0.5875,	1,	1],
    [3,	5,	1,	2.644,	2.644,	0.1187,	0.5288,	3,	3],
    [4,	5,	1,	3.435,	3.435,	0.1413,	0.5725,	2,	2]
]

print(tabulate(table5))
