#!/usr/bin/python3

# TODO:
"""
Варіанти:
                укр     рус      англ
    Варіант 1:  +       +(той же) +(той же)
    (зв'язаний)

    Варіант 3:  +       +(рівний по сим) +(рів по сим)
    (не зв'яз)

Варіант по номеру команди: 3
Середня кількість слів тексту: 2.000
Варіанти задач: 1,3


1. Розробити проект для дослідження кількості інформації та ентропії
дискретного джерела повідомлень відповідно до варіанта.

2. Проект повинен дозволяти:
- визначати кількість інформації в тексті українською, англійською та
німецькою мовами, а також:
- вводити текст повідомлення;
- здійснювати підрахунок частоти появи символу в тексті
повідомлення;
- упорядковувати частоту за зростанням будь-яким алгоритмом
сортування;
- Виводити на екран символ тексту та частоту його появи.
- Виводити кількість інформації у тексті.


Письмовий звіт щодо виконання завдання 1 повинен містити:
1. Титульний лист. (Назва практичної роботи. Прізвище, ім'я, по-
батькові, номер групи виконавця, дата здачі).
2. Математичну постановку задачі. Необхідно навести формули якими
проводилися обчислення.
3. Дослідження кількості інформації в різних фрагментах тексту:
- порівняйте кількість інформації в текстах (у будь-якому зручному
графічному вигляді). Різні тексти з однаковою кількістю символів;
- графіки залежності кількості інформації для кожного варіанту тексту
(4 графіки);
- графіки залежності кількості інформації для одного і того ж
зв'язаного тексту різними мовами (трьома мовами).
- Висновки щодо практичної роботи. Довести властивості інформації
на аналізованих прикладах.
"""

# Основна функція виконання
def main():
    pass


# Якщо файл запускається як основний, то викликати основну функцію
if __name__ == "__main__":
    main()
# Інакше повідомити про помилку
else:
    print("[ERR] Sorry, it can't be used like a module")

